; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x5-y5-t3-k222-l222-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f 
        shape0 shape1 shape2 
        key0-0 key0-1 
        key1-0 key1-1 
        key2-0 key2-1 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(shape shape0)
(shape shape1)
(shape shape2)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(open f0-0f)
(open f1-0f)
(open f2-0f)
(open f4-0f)
(open f0-1f)
(open f1-1f)
(open f2-1f)
(open f3-1f)
(open f4-1f)
(open f1-2f)
(open f2-2f)
(open f3-2f)
(open f0-3f)
(open f2-3f)
(open f3-3f)
(open f4-3f)
(open f1-4f)
(open f3-4f)
(open f4-4f)
(locked f0-4f)
(lock-shape f0-4f shape0)
(locked f3-0f)
(lock-shape f3-0f shape0)
(locked f1-3f)
(lock-shape f1-3f shape1)
(locked f4-2f)
(lock-shape f4-2f shape1)
(locked f0-2f)
(lock-shape f0-2f shape2)
(locked f2-4f)
(lock-shape f2-4f shape2)
(at key0-0 f4-3f)
(at key0-1 f2-4f)
(at key1-0 f4-3f)
(at key1-1 f2-0f)
(at key2-0 f2-2f)
(at key2-1 f4-0f)
(at-robot f2-2f)
)
(:goal
(and
(at key1-0 f0-1f)
(at key2-0 f1-2f)
(at key2-1 f1-1f)
)
)
)

; plan
1. (pickup f2-2f key2-0)
   deleted: (at key2-0 f2-2f) (arm-empty)
   added: (holding key2-0)
   goals met: 0 of 3
2. (move f2-2f f1-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f1-2f)
   goals met: 0 of 3
3. (putdown f1-2f key2-0)
   deleted: (holding key2-0)
   added: (arm-empty) (at key2-0 f1-2f)
   goals met: 1 of 3
4. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 1 of 3
5. (move f1-1f f2-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f2-1f)
   goals met: 1 of 3
6. (move f2-1f f3-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f3-1f)
   goals met: 1 of 3
7. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 1 of 3
8. (move f4-1f f4-0f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-0f)
   goals met: 1 of 3
9. (pickup f4-0f key2-1)
   deleted: (at key2-1 f4-0f) (arm-empty)
   added: (holding key2-1)
   goals met: 1 of 3
10. (move f4-0f f4-1f)
   deleted: (at-robot f4-0f)
   added: (at-robot f4-1f)
   goals met: 1 of 3
11. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 1 of 3
12. (move f3-1f f2-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 1 of 3
13. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 1 of 3
14. (putdown f1-1f key2-1)
   deleted: (holding key2-1)
   added: (arm-empty) (at key2-1 f1-1f)
   goals met: 2 of 3
15. (move f1-1f f2-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f2-1f)
   goals met: 2 of 3
16. (move f2-1f f2-2f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-2f)
   goals met: 2 of 3
17. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 2 of 3
18. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 2 of 3
19. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 2 of 3
20. (pickup f4-3f key1-0)
   deleted: (at key1-0 f4-3f) (arm-empty)
   added: (holding key1-0)
   goals met: 2 of 3
21. (move f4-3f f3-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f3-3f)
   goals met: 2 of 3
22. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 2 of 3
23. (move f3-2f f2-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f2-2f)
   goals met: 2 of 3
24. (move f2-2f f2-1f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 2 of 3
25. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 2 of 3
26. (move f1-1f f0-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f0-1f)
   goals met: 2 of 3
27. (putdown f0-1f key1-0)
   deleted: (holding key1-0)
   added: (arm-empty) (at key1-0 f0-1f)
   goals met: 3 of 3
